{
  "reviews": [
    {"id":"MATH20122","summary": "Classic chalk and talk lecture style, while the tutorials are more like Q&A sessions, that is will talk to students one-to-one, talking through problems on the board if many students are having issues."},
    {"id":"MATH20122","summary": "The course material is often abstract and difficult, and as with most pure courses relies on knowledge of definitions and the ability to reconstruct proofs. However provided you know the definitions, by the middle of the semester everything will fall into place."},
    {"id":"MATH20122","summary": "To aid this, there is a coursework test early on in the semester which tests definitions and examples from the early parts of the course, giving you motivation to actually learn the material!"},
    {"id":"MATH20122","summary": "The lecturer has an infectious level of enthusiasm, which makes you want to engage with the course material."},
    {"id":"MATH20122","summary": "Having said that, do not take this course purely because you like Nige (from MATH10101). It is arguably one of the most divisive course units in terms of difficulty, and requires work at home to keep up."},
    {"id":"MATH20132","summary": "Again, as a pure course, there are a lot of definitions and results (with proofs). However, these proofs often follow straight from the definition, there are very few tricks involved."},
    {"id":"MATH20132","summary": "The applications of these results is the more important aspect of the course, and it is this which makes it vital for several higher level courses."},
    {"id":"MATH20132","summary": "The start of the course goes well alongside Metric Spaces and towards the end there is large overlap with Introduction to Geometry (see below), but it is not necessary to take all three, just helpful!"},
    {"id":"MATH20132","summary": "Keeping up with problem sheets is vital, often it is the case that if you know how to do the examles the underlying theory becomes quite simple."},
    {"id":"MATH20132","summary": "Little else can be said of the course until the new lecturer has stamped their mark on it. If it continues in the spirit of previous years, it is the applications that are tested more than the base theory, with very few proofs ever actually asked for in the exam."},
    {"id":"MATH20142","summary": "The material is well explained, although sometimes the delivery can be dry."},
    {"id":"MATH20142","summary": "There are more applications in this course than in (joint honours) real analysis, avoiding the complications of some of the more tricky results."},
    {"id":"MATH20142","summary": "The course still contains a fair number of proofs, however do not be put off by this as complex analysis is a hugely useful tool."},
    {"id":"MATH20142","summary": "All about the theory of complex numbers, for example, what does it mean to say we can differentiate a complex function?"},
    {"id":"MATH20142","summary": "Builds up to some interesting uses, calculating integrals that are virtually impossible to do by standard methods being one of them."},
    {"id":"MATH20212","summary": "The lecturer is highly thought of by all students, always willing to help and shows great passion for the subject."},
    {"id":"MATH20212","summary": "The lectures are chalk and talk, and follow closely to the lecture notes. However, some useful examples and little hints are only mentioned in lectures, so attendance is vital."},
    {"id":"MATH20212","summary": "The tutorials have their own problem sheet, designed to get students familiar with the basics before they try the regular problem sheets. Dr. Walker is always willing to answer questions one-to-one if it’s wanted."},
    {"id":"MATH20212","summary": "As is traditional with pure course units, there are a lot of definitions and proofs, however the latter stem quite naturally from the former."},
    {"id":"MATH20212","summary": "The exams are fair, very rarely do you get a question you can’t answer, it just depends how familiar you are with the material."},
    {"id":"MATH20222","summary": "The lecturer has received mixed reviews, but his passion for the course is undisputed, and he tries to make sure students understand the material as opposed to just memorising equations. He even tries to learn every students name, which is a nice touch."},
    {"id":"MATH20222","summary": "Chalk and talk lecture style, however sometimes the lecturer will jump from board to board, so it is important to listen and try to understand what is going on."},
    {"id":"MATH20222","summary": "Material builds on linear algebra, showing it from a new viewpoint, and the lecturer will spend a few weeks on seemingly easy things. As a result of this, the latter parts of the course may seem rushed, but this can easily be accounted for by working through the examples sheets."},
    {"id":"MATH20222","summary": "Tutorials involve going through problems, and sometimes the lecturer will ask students to answer problems on the board, though he doesn’t force you to if you don’t want to"},
    {"id":"MATH20222","summary": "The coursework is designed to be challenging, to see how well you can apply the course to various abstract situations. Having said that, the exams are very fair and he gives out a few hints regarding the types of questions that might be asked."},
    {"id":"MATH20222","summary": "Despite being a pure course, being able to do the examples is the most important thing, very few proofs are ever asked, since it is the applications of theoretical results that is interesting. For example, from a certain point of view a cone and a plane are the same, and the sphere is not."},
    {"id":"MATH20502","summary": "Good, approachable lecturer, however course materials usually not available online."},
    {"id":"MATH20502","summary": "This course is tricky, many results are derived from principles and these can leave you feeling lost for a few weeks at the beginning. However, once you get to grips with the methods the work becomes a lot easier."},
    {"id":"MATH20502","summary": "Puts a lot of previous material, such as partial differentiation and complex numbers, to practical use. Also introduces a few techniques and ideas that prove useful for higher level applied maths."},
    {"id":"MATH20502","summary": "There are some long derivations to learn, but these can be deduced with relative ease if you know the material."},
    {"id":"MATH20502","summary": "Coursework test is marked harshly if students don’t display understanding and just plug in results, but the exam is fair if you have revised properly."},
    {"id":"MATH20512","summary": "Some credit this as the most difficult level two course, however others have found it easy, depending on if you like mechanics or not."},
    {"id":"MATH20512","summary": "A background in physics, or at least some familiarity with A-level (or equivalent) mechanics, while not strictly required, is useful when it comes to visualising the problems"},
    {"id":"MATH20512","summary": "There is not a lot of theory in this course, but each bit of theory comes with a collection of applications which it is vital to get to grips with."},
    {"id":"MATH20512","summary": "Lecturer is approachable and good at teaching, knows where students tend to make mistakes."},
    {"id":"MATH20512","summary": "Examples classes are not the most useful unless you have any specific problems you want addressing."},
    {"id":"MATH20712","summary": "Lots of proofs, which are all examinable. However, most of these can be logically derived by using methods covered in the course."},
    {"id":"MATH20712","summary": "Plenty of formulae to memorise, but this is simple given you need their derivations."},
    {"id":"MATH20712","summary": "Starts off relatively easy, recapping some of the important aspects of Probability 2 from the first semester, but the workload increases after about week two."},
    {"id":"MATH20712","summary": "The exams are relatively straightforward, very rarely will you see something unfamiliar, which makes revision a lot easier."},
    {"id":"MATH20712","summary": "Cover some interesting problems to do with population dynamics (extinction and expansion) and the Gamblers Ruin Problem."},
    {"id":"MATH20722","summary": "Often viewed as more of a course in pure mathematics as opposed to probability, due to the style in which it is given."},
    {"id":"MATH20722","summary": "The methods here are useful for those who want to do higher level probability courses, though taking this course is not strictly necessary for a lot of these."},
    {"id":"MATH20722","summary": "The course is seen as a chance for some diversity for those who wish to take mainly probability and statistic courses."},
    {"id":"MATH20722","summary": "Lecturer willing to help, even outside of the designated lecture schedule."},
    {"id":"MATH20722","summary": "Attendance is key, as there are no online notes except for some reference notes from several years ago."},
    {"id":"MATH20802","summary": "At the beginning of the course the lecturer hands out summary lecture notes and a list of examples, however you will not pass the course if you only use those notes, and there are no solutions to the examples (except those that are also on problem sheets)."},
    {"id":"MATH20802","summary": "It is necessary to learn a few ‘tricks’ for each section of the course, in particular to help solve some of the problems on the sheets and in the exam."},
    {"id":"MATH20802","summary": "A few proofs are needed, but these are only available in lectures and not included in the summary notes"},
    {"id":"MATH20802","summary": "There is relatively little content, the focus is more on the methods and ideas involved, which make this a prerequisite for a lot of courses (see above)."},
    {"id":"MATH20802","summary": "The midterms are usually very hard, the average mark two years ago was 9/20. However the lecturer emails students a few weeks before the exam to say what topics are covered."},
    {"id":"MATH20812","summary": "This course is based around using computers, in particular using R, the statistical data software."},
    {"id":"MATH20812","summary": "The coursework elements are generally quite straightforward and the content itself isn’t too difficult. However attending the lab sessions is vital in order to secure a good mark."},
    {"id":"MATH20812","summary": "It has been known to be able to get bonus marks for extra work, for example answering extra problems or going above and beyond what is expected"},
    {"id":"MATH20812","summary": "Perhaps most importantly you learn how to write reports, a transferable skill that is vital in some career paths."},
    {"id":"MATH20902","summary": "This course is an interesting and different brand of mathematics to any of the above, but is similar in principle to any decision maths course units from A-Level (or equivalent). However don’t assume it’s easy just because you did it in school."},
    {"id":"MATH20902","summary": "The lecturer is friendly and approachable, though his lecture style divides opinion, sometimes on the board and other times using slides"},
    {"id":"MATH20902","summary": "The problem sheets are very long, and the problems themselves take a long time. The lecturer narrows the problems down to a list that will be the same/similar to those on the exam, but learning the methods is the vital part."},
    {"id":"MATH20902","summary": "Most problems in this course revolve around graph theory, and does provide some interesting applications. The lecturer often recommends papers and books to read on the subject."},
    {"id":"MATH20902","summary": "Despite not being a prerequisite for anything, elements of this course come up in many areas of mathematics. In particular, anyone who would like to study real-life systems with interactions (computer, biological, etc) is advised to give this course serious consideration"},
    {"id":"MATH20602","summary": "Lecturer is approachable, friendly, and responds to emails quickly."},
    {"id":"MATH20602","summary": "The course revolves around studying the methods by which we can approximate solutions to problems that would be very difficult to solve by hand. Sometimes MATLAB is used to demonstrate the ideas presented, but you will not be required to use this yourself."},
    {"id":"MATH20602","summary": "It is helpful to think of this course as a combination of pure and applied mathematics. As a result, a broad spectrum of problems are covered, for example solution stability, basic matrix properties, and integration methods."},
    {"id":"MATH20602","summary": "There are a fair few proofs coming from the pure aspect of this course, some of which are fairly technical, however towards the end of semester the lecturer tells you which are certainly non examinable."},
    {"id":"MATH20602","summary": "The midterm test and final exam are both fair provided you know and have engaged with the material and haven’t just tried to learn how to pass the exam."},
    {"id":"MATH20302","summary": "The lecturer is popular among students, very helpful and understands the points on which students struggle."},
    {"id":"MATH20302","summary": "The course is very proof heavy, though most are not examinable. However, the applications of the results makes up the course, so a good knowledge of the theory is vital."},
    {"id":"MATH20302","summary": "It has been commented that the online notes do not sufficiently cover the course, so make sure if you have to miss a lecture that you will be able to acquires notes from elsewhere."},
    {"id":"MATH20302","summary": "A fairly straightforward course, in the sense that if you stay on top of the material the increasing level of complexity as the semester goes on will not prove much of a stumbling block."},
    {"id":"MATH20302","summary": "The course is all to do with how we construct proofs, proving logical sentences and the such, as the ability to show that a statement is true or false is a powerful weapon, one not available in almost all other subjects."},
    {"id":"MATH20912","summary": "Lectures are mainly powerpoint slides, with a few diagrams and side notes written on the board."},
    {"id":"MATH20912","summary": "The lecturer is friendly and approachable, though is often busy so it’s important to ask problems during class when appropriate."},
    {"id":"MATH20912","summary": "Generally this is considered as an applied course, so a main complaint is that whilst there are lots of formulae, you often don’t get to see where it comes from or why it works, just that it works."},
    {"id":"MATH20912","summary": "Tutorials are described as helpful, as they fill in any gaps from lectures, and help with understanding of examples."},
    {"id":"MATH20912","summary": "This course is not strictly necessary to do higher level finance course units, however it does provide a good foothold into the terminology and notions behind more complicated aspects of financial mathematics."},
    {"id":"MATH20622","summary": "A course designed to teach the basics of computer programming. While the main tool is Python, most of the skills learned are transferable to the other commonly used programs"},
    {"id":"MATH20622","summary": "No prior knowledge of programming is required, however if you have ever done it before or have an interest in it then the course is made immeasurably easier."},
    {"id":"MATH20622","summary": "The coursework is very long, and quite difficult to get going with, but you are allowed to use outside materials to help (provided they are referenced appropriately)."},
    {"id":"MATH20622","summary": "As a result of being a coursework only course unit, students taking this course have one exam less in the summer term, however (as with the level three computing course) do not take this as an easy few marks, it will be time consuming, so being able to juggle this with your other course units is important."},
    {"id":"MATH20522","summary": "A course designed to show how mathematics is used in industry and other disciplines. Useful for those who wish to go into these sorts of fields in the future."},
    {"id":"MATH20522","summary": "Students do have to do presentations on their work, however this is good practice for many career choices, and it’s also a chance to try something that you don’t get to do very often in mathematics."},
    {"id":"MATH20522","summary": "There are fewer actual lectures in this course than others, instead they are replaced by group work sessions and the study of specific problems."},
    {"id":"MATH31011","summary": "Usually a small course, however the material has been described as interesting, if quite challenging."},
    {"id":"MATH31011","summary": "The lecturer is very good, widely respected and always approachable."},
    {"id":"MATH31011","summary": "All materials are made available online, and the lecture notes in particular are high quality."},
    {"id":"MATH31011","summary": "There is some overlap with Essential PDE’s (MATH36041) and Martingales with Applications to Finance (MATH37001)."},
    {"id":"MATH31011","summary": "This course can be taken as a 15-credit version, the extra material consists of three sections running parallel to topics covered in the course."},
    {"id":"MATH31051","summary": " Classic chalk and talk lecture style, and the course follows a definition-theorem-proof method akin to Metric Spaces. the lecturer knows which proofs students don’t like and really helps explain these in detail."},
    {"id":"MATH31051","summary": "The style of the examples and proofs are similar to those in Metric Spaces, however it is not necessary to have done that course. That is, if you know the definitions, often the results can be retrieved in a few steps."},
    {"id":"MATH31051","summary": "Problem sheets consist of examples as well as some smaller proofs, to make sure students know what they’re doing. The lecture notes are very good, and contain all the relevant detail, however there are some very useful insights given in the lectures."},
    {"id":"MATH31051","summary": "The exams and coursework are fair, and the lecturer is more than happy to address problems on a one-to-one basis."},
    {"id":"MATH31051","summary": "Available as a 15-credit version, the extra material is three sections of notes posted online after any relevant material is covered in lectures"},
    {"id":"MATH31061","summary": "A different type course to those seen before. Lots of definitions, while the material is covered from both an analytic and topological perspective"},
    {"id":"MATH31061","summary": "While there are some proofs which need be learned, much of the course is based around recurring examples, projective space, spheres, etc."},
    {"id":"MATH31061","summary": "There is a large amount of content in the course, which does cause a rush towards the end which doesn’t help some of the more abstract ideas sink in."},
    {"id":"MATH31061","summary": "The lecturer is fast at replying to emails, and will use examples classes to help students get through some of the trickier problems. In addition he posts which material is relevant a few weeks before the exam."},
    {"id":"MATH31061","summary": "Available as a 15-credit version, the extra material is covered in lectures and appears in the regular notes, but a lot of this is proving results that the 10-credit version assumes."},
    {"id":"MATH32001","summary": "This course follows on from the material in Algebraic Structures 1 and 2, lots of familiar concepts. No online notes, example sheets and solutions given out in lectures."},
    {"id":"MATH32001","summary": "Chalk and talk lecture style, a lot of proofs as is common in pure mathematics."},
    {"id":"MATH32001","summary": "Challenging but not difficult course, remembering definitions and proofs bodes well for the final exam."},
    {"id":"MATH32001","summary": "Available as a 15-credit version, extra material is a large booklet of notes, mostly definitions and proofs with examples at the very end. It is advisable to go through this as the course goes along, as there is perhaps too much content to leave it until the last minute."}
  ]

}
