{
  "reviews": [
    {
      "id": 1,
      "unit":"MATH20122",
      "summary": "Classic chalk and talk lecture style, while the tutorials are more like Q&A sessions, that is will talk to students one-to-one, talking through problems on the board if many students are having issues."
    },
    {
      "id": 2,
      "unit":"MATH20122",
      "summary": "The course material is often abstract and difficult, and as with most pure courses relies on knowledge of definitions and the ability to reconstruct proofs. However provided you know the definitions, by the middle of the semester everything will fall into place."
    },
    {
      "id": 3,
      "unit":"MATH20122",
      "summary": "To aid this, there is a coursework test early on in the semester which tests definitions and examples from the early parts of the course, giving you motivation to actually learn the material!"
    },
    {
      "id": 4,
      "unit":"MATH20122",
      "summary": "The lecturer has an infectious level of enthusiasm, which makes you want to engage with the course material."
    },
    {
      "id": 5,
      "unit":"MATH20122",
      "summary": "Having said that, do not take this course purely because you like Nige (from MATH10101). It is arguably one of the most divisive course units in terms of difficulty, and requires work at home to keep up."
    },
    {
      "id": 6,
      "unit":"MATH20132",
      "summary": "Again, as a pure course, there are a lot of definitions and results (with proofs). However, these proofs often follow straight from the definition, there are very few tricks involved."
    },
    {
      "id": 7,
      "unit":"MATH20132",
      "summary": "The applications of these results is the more important aspect of the course, and it is this which makes it vital for several higher level courses."
    },
    {
      "id": 8,
      "unit":"MATH20132",
      "summary": "The start of the course goes well alongside Metric Spaces and towards the end there is large overlap with Introduction to Geometry (see below), but it is not necessary to take all three, just helpful!"
    },
    {
      "id": 9,
      "unit":"MATH20132",
      "summary": "Keeping up with problem sheets is vital, often it is the case that if you know how to do the examles the underlying theory becomes quite simple."
    },
    {
      "id": 10,
      "unit":"MATH20132",
      "summary": "Little else can be said of the course until the new lecturer has stamped their mark on it. If it continues in the spirit of previous years, it is the applications that are tested more than the base theory, with very few proofs ever actually asked for in the exam."
    },
    {
      "id": 11,
      "unit":"MATH20142",
      "summary": "The material is well explained, although sometimes the delivery can be dry."
    },
    {
      "id": 12,
      "unit":"MATH20142",
      "summary": "There are more applications in this course than in (joint honours) real analysis, avoiding the complications of some of the more tricky results."
    },
    {
      "id": 13,
      "unit":"MATH20142",
      "summary": "The course still contains a fair number of proofs, however do not be put off by this as complex analysis is a hugely useful tool."
    },
    {
      "id": 14,
      "unit":"MATH20142",
      "summary": "All about the theory of complex numbers, for example, what does it mean to say we can differentiate a complex function?"
    },
    {
      "id": 15,
      "unit":"MATH20142",
      "summary": "Builds up to some interesting uses, calculating integrals that are virtually impossible to do by standard methods being one of them."
    },
    {
      "id": 16,
      "unit":"MATH20212",
      "summary": "The lecturer is highly thought of by all students, always willing to help and shows great passion for the subject."
    },
    {
      "id": 17,
      "unit":"MATH20212",
      "summary": "The lectures are chalk and talk, and follow closely to the lecture notes. However, some useful examples and little hints are only mentioned in lectures, so attendance is vital."
    },
    {
      "id": 18,
      "unit":"MATH20212",
      "summary": "The tutorials have their own problem sheet, designed to get students familiar with the basics before they try the regular problem sheets. Dr. Walker is always willing to answer questions one-to-one if it’s wanted."
    },
    {
      "id": 19,
      "unit":"MATH20212",
      "summary": "As is traditional with pure course units, there are a lot of definitions and proofs, however the latter stem quite naturally from the former."
    },
    {
      "id": 20,
      "unit":"MATH20212",
      "summary": "The exams are fair, very rarely do you get a question you can’t answer, it just depends how familiar you are with the material."
    },
    {
      "id": 21,
      "unit":"MATH20222",
      "summary": "The lecturer has received mixed reviews, but his passion for the course is undisputed, and he tries to make sure students understand the material as opposed to just memorising equations. He even tries to learn every students name, which is a nice touch."
    },
    {
      "id": 22,
      "unit":"MATH20222",
      "summary": "Chalk and talk lecture style, however sometimes the lecturer will jump from board to board, so it is important to listen and try to understand what is going on."
    },
    {
      "id": 23,
      "unit":"MATH20222",
      "summary": "Material builds on linear algebra, showing it from a new viewpoint, and the lecturer will spend a few weeks on seemingly easy things. As a result of this, the latter parts of the course may seem rushed, but this can easily be accounted for by working through the examples sheets."
    },
    {
      "id": 24,
      "unit":"MATH20222",
      "summary": "Tutorials involve going through problems, and sometimes the lecturer will ask students to answer problems on the board, though he doesn’t force you to if you don’t want to"
    },
    {
      "id": 25,
      "unit":"MATH20222",
      "summary": "The coursework is designed to be challenging, to see how well you can apply the course to various abstract situations. Having said that, the exams are very fair and he gives out a few hints regarding the types of questions that might be asked."
    },
    {
      "id": 26,
      "unit":"MATH20222",
      "summary": "Despite being a pure course, being able to do the examples is the most important thing, very few proofs are ever asked, since it is the applications of theoretical results that is interesting. For example, from a certain point of view a cone and a plane are the same, and the sphere is not."
    },
    {
      "id": 27,
      "unit":"MATH20502",
      "summary": "Good, approachable lecturer, however course materials usually not available online."
    },
    {
      "id": 28,
      "unit":"MATH20502",
      "summary": "This course is tricky, many results are derived from principles and these can leave you feeling lost for a few weeks at the beginning. However, once you get to grips with the methods the work becomes a lot easier."
    },
    {
      "id": 29,
      "unit":"MATH20502",
      "summary": "Puts a lot of previous material, such as partial differentiation and complex numbers, to practical use. Also introduces a few techniques and ideas that prove useful for higher level applied maths."
    },
    {
      "id": 30,
      "unit":"MATH20502",
      "summary": "There are some long derivations to learn, but these can be deduced with relative ease if you know the material."
    },
    {
      "id": 31,
      "unit":"MATH20502",
      "summary": "Coursework test is marked harshly if students don’t display understanding and just plug in results, but the exam is fair if you have revised properly."
    },
    {
      "id": 32,
      "unit":"MATH20512",
      "summary": "Some credit this as the most difficult level two course, however others have found it easy, depending on if you like mechanics or not."
    },
    {
      "id": 33,
      "unit":"MATH20512",
      "summary": "A background in physics, or at least some familiarity with A-level (or equivalent) mechanics, while not strictly required, is useful when it comes to visualising the problems"
    },
    {
      "id": 34,
      "unit":"MATH20512",
      "summary": "There is not a lot of theory in this course, but each bit of theory comes with a collection of applications which it is vital to get to grips with."
    },
    {
      "id": 35,
      "unit":"MATH20512",
      "summary": "Lecturer is approachable and good at teaching, knows where students tend to make mistakes."
    },
    {
      "id": 36,
      "unit":"MATH20512",
      "summary": "Examples classes are not the most useful unless you have any specific problems you want addressing."
    },
    {
      "id": 37,
      "unit":"MATH20712",
      "summary": "Lots of proofs, which are all examinable. However, most of these can be logically derived by using methods covered in the course."
    },
    {
      "id": 38,
      "unit":"MATH20712",
      "summary": "Plenty of formulae to memorise, but this is simple given you need their derivations."
    },
    {
      "id": 39,
      "unit":"MATH20712",
      "summary": "Starts off relatively easy, recapping some of the important aspects of Probability 2 from the first semester, but the workload increases after about week two."
    },
    {
      "id": 40,
      "unit":"MATH20712",
      "summary": "The exams are relatively straightforward, very rarely will you see something unfamiliar, which makes revision a lot easier."
    },
    {
      "id": 41,
      "unit":"MATH20712",
      "summary": "Cover some interesting problems to do with population dynamics (extinction and expansion) and the Gamblers Ruin Problem."
    },
    {
      "id": 42,
      "unit":"MATH20722",
      "summary": "Often viewed as more of a course in pure mathematics as opposed to probability, due to the style in which it is given."
    },
    {
      "id": 43,
      "unit":"MATH20722",
      "summary": "The methods here are useful for those who want to do higher level probability courses, though taking this course is not strictly necessary for a lot of these."
    },
    {
      "id": 44,
      "unit":"MATH20722",
      "summary": "The course is seen as a chance for some diversity for those who wish to take mainly probability and statistic courses."
    },
    {
      "id": 45,
      "unit":"MATH20722",
      "summary": "Lecturer willing to help, even outside of the designated lecture schedule."
    },
    {
      "id": 46,
      "unit":"MATH20722",
      "summary": "Attendance is key, as there are no online notes except for some reference notes from several years ago."
    },
    {
      "id": 47,
      "unit":"MATH20802",
      "summary": "At the beginning of the course the lecturer hands out summary lecture notes and a list of examples, however you will not pass the course if you only use those notes, and there are no solutions to the examples (except those that are also on problem sheets)."
    },
    {
      "id": 48,
      "unit":"MATH20802",
      "summary": "It is necessary to learn a few ‘tricks’ for each section of the course, in particular to help solve some of the problems on the sheets and in the exam."
    },
    {
      "id": 49,
      "unit":"MATH20802",
      "summary": "A few proofs are needed, but these are only available in lectures and not included in the summary notes"
    },
    {
      "id": 50,
      "unit":"MATH20802",
      "summary": "There is relatively little content, the focus is more on the methods and ideas involved, which make this a prerequisite for a lot of courses (see above)."
    },
    {
      "id": 51,
      "unit":"MATH20802",
      "summary": "The midterms are usually very hard, the average mark two years ago was 9/20. However the lecturer emails students a few weeks before the exam to say what topics are covered."
    },
    {
      "id": 52,
      "unit":"MATH20812",
      "summary": "This course is based around using computers, in particular using R, the statistical data software."
    },
    {
      "id": 53,
      "unit":"MATH20812",
      "summary": "The coursework elements are generally quite straightforward and the content itself isn’t too difficult. However attending the lab sessions is vital in order to secure a good mark."
    },
    {
      "id": 54,
      "unit":"MATH20812",
      "summary": "It has been known to be able to get bonus marks for extra work, for example answering extra problems or going above and beyond what is expected"
    },
    {
      "id": 55,
      "unit":"MATH20812",
      "summary": "Perhaps most importantly you learn how to write reports, a transferable skill that is vital in some career paths."
    },
    {
      "id": 56,
      "unit":"MATH20902",
      "summary": "This course is an interesting and different brand of mathematics to any of the above, but is similar in principle to any decision maths course units from A-Level (or equivalent). However don’t assume it’s easy just because you did it in school."
    },
    {
      "id": 57,
      "unit":"MATH20902",
      "summary": "The lecturer is friendly and approachable, though his lecture style divides opinion, sometimes on the board and other times using slides"
    },
    {
      "id": 58,
      "unit":"MATH20902",
      "summary": "The problem sheets are very long, and the problems themselves take a long time. The lecturer narrows the problems down to a list that will be the same/similar to those on the exam, but learning the methods is the vital part."
    },
    {
      "id": 59,
      "unit":"MATH20902",
      "summary": "Most problems in this course revolve around graph theory, and does provide some interesting applications. The lecturer often recommends papers and books to read on the subject."
    },
    {
      "id": 60,
      "unit":"MATH20902",
      "summary": "Despite not being a prerequisite for anything, elements of this course come up in many areas of mathematics. In particular, anyone who would like to study real-life systems with interactions (computer, biological, etc) is advised to give this course serious consideration"
    },
    {
      "id": 61,
      "unit":"MATH20602",
      "summary": "Lecturer is approachable, friendly, and responds to emails quickly."
    },
    {
      "id": 62,
      "unit":"MATH20602",
      "summary": "The course revolves around studying the methods by which we can approximate solutions to problems that would be very difficult to solve by hand. Sometimes MATLAB is used to demonstrate the ideas presented, but you will not be required to use this yourself."
    },
    {
      "id": 63,
      "unit":"MATH20602",
      "summary": "It is helpful to think of this course as a combination of pure and applied mathematics. As a result, a broad spectrum of problems are covered, for example solution stability, basic matrix properties, and integration methods."
    },
    {
      "id": 64,
      "unit":"MATH20602",
      "summary": "There are a fair few proofs coming from the pure aspect of this course, some of which are fairly technical, however towards the end of semester the lecturer tells you which are certainly non examinable."
    },
    {
      "id": 65,
      "unit":"MATH20602",
      "summary": "The midterm test and final exam are both fair provided you know and have engaged with the material and haven’t just tried to learn how to pass the exam."
    },
    {
      "id": 67,
      "unit": "MATH20602",
      "summary": "The midterm test and final exam are both fair provided you know and have engaged with the material and haven’t just tried to learn how to pass the exam."
    },
    {
      "id": 68,
      "unit": "MATH20302",
      "summary": "The lecturer is popular among students, very helpful and understands the points on which students struggle."
    },
    {
      "id": 69,
      "unit": "MATH20302",
      "summary": "The course is very proof heavy, though most are not examinable. However, the applications of the results makes up the course, so a good knowledge of the theory is vital."
    },
    {
      "id": 70,
      "unit": "MATH20302",
      "summary": "It has been commented that the online notes do not sufficiently cover the course, so make sure if you have to miss a lecture that you will be able to acquires notes from elsewhere."
    },
    {
      "id": 71,
      "unit": "MATH20302",
      "summary": "A fairly straightforward course, in the sense that if you stay on top of the material the increasing level of complexity as the semester goes on will not prove much of a stumbling block."
    },
    {
      "id": 72,
      "unit": "MATH20302",
      "summary": "The course is all to do with how we construct proofs, proving logical sentences and the such, as the ability to show that a statement is true or false is a powerful weapon, one not available in almost all other subjects."
    },
    {
      "id": 73,
      "unit": "MATH20912",
      "summary": "Lectures are mainly powerpoint slides, with a few diagrams and side notes written on the board."
    },
    {
      "id": 74,
      "unit": "MATH20912",
      "summary": "The lecturer is friendly and approachable, though is often busy so it’s important to ask problems during class when appropriate."
    },
    {
      "id": 75,
      "unit": "MATH20912",
      "summary": "Generally this is considered as an applied course, so a main complaint is that whilst there are lots of formulae, you often don’t get to see where it comes from or why it works, just that it works."
    },
    {
      "id": 76,
      "unit": "MATH20912",
      "summary": "Tutorials are described as helpful, as they fill in any gaps from lectures, and help with understanding of examples."
    },
    {
      "id": 77,
      "unit": "MATH20912",
      "summary": "This course is not strictly necessary to do higher level finance course units, however it does provide a good foothold into the terminology and notions behind more complicated aspects of financial mathematics."
    },
    {
      "id": 78,
      "unit": "MATH20622",
      "summary": "A course designed to teach the basics of computer programming. While the main tool is Python, most of the skills learned are transferable to the other commonly used programs"
    },
    {
      "id": 79,
      "unit": "MATH20622",
      "summary": "No prior knowledge of programming is required, however if you have ever done it before or have an interest in it then the course is made immeasurably easier."
    },
    {
      "id": 80,
      "unit": "MATH20622",
      "summary": "The coursework is very long, and quite difficult to get going with, but you are allowed to use outside materials to help (provided they are referenced appropriately)."
    },
    {
      "id": 81,
      "unit": "MATH20622",
      "summary": "As a result of being a coursework only course unit, students taking this course have one exam less in the summer term, however (as with the level three computing course) do not take this as an easy few marks, it will be time consuming, so being able to juggle this with your other course units is important."
    },
    {
      "id": 82,
      "unit": "MATH20522",
      "summary": "A course designed to show how mathematics is used in industry and other disciplines. Useful for those who wish to go into these sorts of fields in the future."
    },
    {
      "id": 83,
      "unit": "MATH20522",
      "summary": "Students do have to do presentations on their work, however this is good practice for many career choices, and it’s also a chance to try something that you don’t get to do very often in mathematics."
    },
    {
      "id": 84,
      "unit": "MATH20522",
      "summary": "There are fewer actual lectures in this course than others, instead they are replaced by group work sessions and the study of specific problems."
    },
    {
      "id": 85,
      "unit": "MATH31011",
      "summary": "Usually a small course, however the material has been described as interesting, if quite challenging."
    },
    {
      "id": 86,
      "unit": "MATH31011",
      "summary": "The lecturer is very good, widely respected and always approachable."
    },
    {
      "id": 87,
      "unit": "MATH31011",
      "summary": "All materials are made available online, and the lecture notes in particular are high quality."
    },
    {
      "id": 88,
      "unit": "MATH31011",
      "summary": "There is some overlap with Essential PDE’s (MATH36041) and Martingales with Applications to Finance (MATH37001)."
    },
    {
      "id": 89,
      "unit": "MATH31011",
      "summary": "This course can be taken as a 15-credit version, the extra material consists of three sections running parallel to topics covered in the course."
    },
    {
      "id": 90,
      "unit": "MATH31051",
      "summary": "Classic chalk and talk lecture style, and the course follows a definition-theorem-proof method akin to Metric Spaces. the lecturer knows which proofs students don’t like and really helps explain these in detail."
    },
    {
      "id": 91,
      "unit": "MATH31051",
      "summary": "The style of the examples and proofs are similar to those in Metric Spaces, however it is not necessary to have done that course. That is, if you know the definitions, often the results can be retrieved in a few steps."
    },
    {
      "id": 92,
      "unit": "MATH31051",
      "summary": "Problem sheets consist of examples as well as some smaller proofs, to make sure students know what they’re doing. The lecture notes are very good, and contain all the relevant detail, however there are some very useful insights given in the lectures."
    },
    {
      "id": 93,
      "unit": "MATH31051",
      "summary": "The exams and coursework are fair, and the lecturer is more than happy to address problems on a one-to-one basis."
    },
    {
      "id": 94,
      "unit": "MATH31051",
      "summary": "Available as a 15-credit version, the extra material is three sections of notes posted online after any relevant material is covered in lectures"
    },
    {
      "id": 95,
      "unit": "MATH31061",
      "summary": "A different type course to those seen before. Lots of definitions, while the material is covered from both an analytic and topological perspective"
    },
    {
      "id": 96,
      "unit": "MATH31061",
      "summary": "While there are some proofs which need be learned, much of the course is based around recurring examples, projective space, spheres, etc."
    },
    {
      "id": 97,
      "unit": "MATH31061",
      "summary": "There is a large amount of content in the course, which does cause a rush towards the end which doesn’t help some of the more abstract ideas sink in."
    },
    {
      "id": 98,
      "unit": "MATH31061",
      "summary": "The lecturer is fast at replying to emails, and will use examples classes to help students get through some of the trickier problems. In addition he posts which material is relevant a few weeks before the exam."
    },
    {
      "id": 99,
      "unit": "MATH31061",
      "summary": "Available as a 15-credit version, the extra material is covered in lectures and appears in the regular notes, but a lot of this is proving results that the 10-credit version assumes."
    },
    {
      "id": 100,
      "unit": "MATH32001",
      "summary": "This course follows on from the material in Algebraic Structures 1 and 2, lots of familiar concepts. No online notes, example sheets and solutions given out in lectures."
    },
    {
      "id": 101,
      "unit": "MATH32001",
      "summary": "Chalk and talk lecture style, a lot of proofs as is common in pure mathematics."
    },
    {
      "id": 102,
      "unit": "MATH32001",
      "summary": "Challenging but not difficult course, remembering definitions and proofs bodes well for the final exam."
    },
    {
      "id": 103,
      "unit": "MATH32001",
      "summary": "Available as a 15-credit version, extra material is a large booklet of notes, mostly definitions and proofs with examples at the very end. It is advisable to go through this as the course goes along, as there is perhaps too much content to leave it until the last minute."
    },
    {
      "id": 104,
      "unit": "MATH32031",
      "summary": "A popular lecturer among his students, prefers chalk and talk to any other style, though reverts to projector slides if the room doesn’t have boards."
    },
    {
      "id": 105,
      "unit": "MATH32031",
      "summary": "An application of linear algebra, but taught in a similar style to a pure course unit. A unique course in the sense that it is abstract yet applied."
    },
    {
      "id": 106,
      "unit": "MATH32031",
      "summary": "Examination tests knowledge on concepts of the course, as well as routine computation questions. The online test can be taken multiple times and is open book."
    },
    {
      "id": 107,
      "unit": "MATH32031",
      "summary": "The online notes are good and make revision very easy to organise."
    },
    {
      "id": 108,
      "unit": "MATH32051",
      "summary": "The lecturer has received good reviews, a chalk and talk style with some humour thrown in for good measure."
    },
    {
      "id": 109,
      "unit": "MATH32051",
      "summary": "During the examples classes the lecturer tries to get students to engage with particularly important problems, giving hints when stuck."
    },
    {
      "id": 110,
      "unit": "MATH32051",
      "summary": "Comprehensive online materials that are used by other universities also."
    },
    {
      "id": 111,
      "unit": "MATH32051",
      "summary": "Anyone taking this course should be comfortable with complex numbers, or willing to relearn them. However, this course doesn’t really link on to anything, other than showing a new style of geometry."
    },
    {
      "id": 112,
      "unit": "MATH32051",
      "summary": "Available as a 15-credit version, the extra material is covered during fortnightly problems classes specifically for students doing this material."
    },
    {
      "id": 113,
      "unit": "MATH32071",
      "summary": "Friendly lecturer, always willing to help students negotiate tricky ideas."
    },
    {
      "id": 114,
      "unit": "MATH32071",
      "summary": "The course builds upon the ideas from the second half of MATH10101, putting them in a new light. New notions are introduced, which simplify some of these previous ideas, and allow the solving of more complicated problems."
    },
    {
      "id": 115,
      "unit": "MATH32071",
      "summary": "There are a reasonably large number of proofs, however if revised sufficiently these are no problem during the exam. Applications of the results are vital in obtaining a good mark."
    },
    {
      "id": 116,
      "unit": "MATH32071",
      "summary": "It is advised that students are familiar with the basic notions of groups and rings, although this is covered to an extent as the course goes along."
    },
    {
      "id": 117,
      "unit": "MATH32071",
      "summary": "Available as a 15-credit version, which consists of a few extra lectures along with some extra reading. There is a lot of material for this however it does make the rest of the course somewhat easier."
    },
    {
      "id": 118,
      "unit": "MATH34001",
      "summary": "Good lecturer, approachable and happy to help, will sit down with students and talk them through problems during examples classes if it’s required."
    },
    {
      "id": 119,
      "unit": "MATH34001",
      "summary": "A more detailed version of what is covered towards the end of Complex Analysis (both single and joint honours versions) for example contour integration."
    },
    {
      "id": 120,
      "unit": "MATH34001",
      "summary": "Not many proofs, the focus is mainly on applications and solving problems, this holds true for the exam too."
    },
    {
      "id": 121,
      "unit": "MATH34001",
      "summary": "Exam questions are lengthy although with practice they are certainly fair."
    },
    {
      "id": 122,
      "unit": "MATH34001",
      "summary": "There have not yet been online notes for this course, however the lecturer covers everything relevant in lectures. Overall a highly recommended course."
    },
    {
      "id": 123,
      "unit": "MATH36001",
      "summary": "A course that builds upon material from Linear Algebra so familiarity with this is essential, or at least a willingness to learn."
    },
    {
      "id": 124,
      "unit": "MATH36001",
      "summary": "Problem sheets difficult, while example classes have been described as not particularly helpful as the solutions are just given out as opposed to talked through."
    },
    {
      "id": 125,
      "unit": "MATH36001",
      "summary": "As with most analysis courses, a large number of proofs, both in lectures and on exams, however exams are fair."
    },
    {
      "id": 126,
      "unit": "MATH36001",
      "summary": "Some examples illustrating methods are only given in lectures and not in the online notes. Similarly, simplifications and helpful tips about proofs are only available in lectures."
    },
    {
      "id": 127,
      "unit": "MATH36001",
      "summary": "Useful if you want to continue working with matrices."
    },
    {
      "id": 128,
      "unit": "MATH34011",
      "summary": "A course recommended for those who like calculus, however some of the work is technical and it is easy to make small mistakes."
    },
    {
      "id": 129,
      "unit": "MATH34011",
      "summary": "Highly methods based course, with an exam very similar to example sheets."
    },
    {
      "id": 130,
      "unit": "MATH34011",
      "summary": "Online notes are thorough and provide a lot of detail."
    },
    {
      "id": 131,
      "unit": "MATH35001",
      "summary": "Lecturer has a lot of passion for the subject which in turn makes you want to learn about the course."
    },
    {
      "id": 132,
      "unit": "MATH35001",
      "summary": "Example classes are helpful provided you have already attempted the problem sheets."
    },
    {
      "id": 133,
      "unit": "MATH35001",
      "summary": "Whilst the lecturers handwriting is not the best, he openly admits to this and is willing to explain until meaning is clear."
    },
    {
      "id": 134,
      "unit": "MATH35001",
      "summary": "A very examples based course, highly recommended for those who like applied mathematics."
    },
    {
      "id": 135,
      "unit": "MATH35001",
      "summary": "Comes in useful for some second semester course units, in particular for the way in which you learn to approach problems."
    },
    {
      "id": 136,
      "unit": "MATH35021",
      "summary": "Regarded by some as the solids equivalent to Viscous Fluid Flow, this course revolves around discussing bodies under stress and strain."
    },
    {
      "id": 137,
      "unit": "MATH35021",
      "summary": "Lecturer is an expert in his field, and really knows how to explain a subject so that you have the best chance of understanding it."
    },
    {
      "id": 136,
      "unit": "MATH35021",
      "summary": "There are not that many derivations, but a lot of examples, so it is key to get to grips with the methods."
    },
    {
      "id": 136,
      "unit": "MATH35021",
      "summary": "Overlaps somewhat with Viscous Fluid Glow."
    },
    {
      "id": 136,
      "unit": "MATH35021",
      "summary": "Exams are usually hard, but marked fairly as it is clear when a student knows the ideas but can’t quite figure out the exact details."
    },
    {
      "id": 137,
      "unit": "MATH36041",
      "summary": "Advised to always concentrate during lectures, as the lecturer edits already written equations rather than doing the steps."
    },
    {
      "id": 138,
      "unit": "MATH36041",
      "summary": "The course content is difficult, to do with approximating PDE solutions."
    },
    {
      "id": 139,
      "unit": "MATH36041",
      "summary": "Example sheets and classes not very helpful unless you have already done the problem sheet, they can be quite boring otherwise."
    },
    {
      "id": 140,
      "unit": "MATH36041",
      "summary": "Links with Fourier Analysis and Lebesgue Integration."
    },
    {
      "id": 141,
      "unit": "MATH37001",
      "summary": "Follows on somewhat from Random Models MATH20712, and uses some aspects of Introduction to Financial Mathematics MATH20912, however neither course is a necessary prerequisite"
    },
    {
      "id": 142,
      "unit": "MATH37001",
      "summary": "Not as proof heavy as Random Models."
    },
    {
      "id": 143,
      "unit": "MATH37001",
      "summary": "The financial applications only became apparent during the final few weeks, so be prepared to wait if that is your aim."
    },
    {
      "id": 144,
      "unit": "MATH38001",
      "summary": "A statistics course that feels a bit like a pure mathematics course during lectures, but the examples and exam are more practical."
    },
    {
      "id": 145,
      "unit": "MATH38001",
      "summary": "A lot of material from the prerequisite Statistical Methods MATH20802 is revisited and covered in more detail."
    },
    {
      "id": 146,
      "unit": "MATH38001",
      "summary": "All about the methods behind statistical analysis of data"
    },
    {
      "id": 147,
      "unit": "MATH38001",
      "summary": "Available as a 15-credit version, which introduces the Bayesian point for statistical testing. This is done over the course of 12 extra lectures over the semester."
    },
    {
      "id": 148,
      "unit": "MATH38061",
      "summary": "Follows on from Statistical Methods MATH20802, by generalising it to problems concerning observations of results based on several variables."
    },
    {
      "id": 149,
      "unit": "MATH38061",
      "summary": "Students learn to use R (the statistical package) to analyse data and present results graphically."
    },
    {
      "id": 150,
      "unit": "MATH38061",
      "summary": "Available as a 15-credit version, the extra material uses the main methods of the course to analyse discrete data."
    },
    {
      "id": 151,
      "unit": "MATH38071",
      "summary": "The course is based on clinical trials and how they are performed, and as such is a very practical course."
    },
    {
      "id": 152,
      "unit": "MATH38071",
      "summary": "The lecturer makes plenty of revision material available before exams."
    },
    {
      "id": 153,
      "unit": "MATH38071",
      "summary": "A lot of formulae and methods to remember, but very few proofs."
    },
    {
      "id": 154,
      "unit": "MATH38091",
      "summary": "There are six pieces of coursework for this course unit, usually in weeks 3, 5, 7, 8, 10 and 11."
    },
    {
      "id": 155,
      "unit": "MATH38091",
      "summary": "A course based on more recent developments in statistics, designed to help students appreciate the usefulness of computers in statistical work."
    },
    {
      "id": 156,
      "unit": "MATH38091",
      "summary": "Students who took Practical Statistics MATH20812 will have an advantage toward the beginning of the course, however it is not necessary to have done this course."
    },
    {
      "id": 157,
      "unit": "MATH38091",
      "summary": "This course is available as a 15-credit version, with extra lectures and computer classes, along with a total of ten coursework assignments (including the six from the 10-credit version)."
    },
    {
      "id": 158,
      "unit": "MATH38141",
      "summary": "Lecture does not focus on proofs of results and instead interprets data"
    },
    {
      "id": 159,
      "unit": "MATH38141",
      "summary": "The aim of the course is to familiarise students with the methodology and applications of standard techniques used in statistical analysis."
    },
    {
      "id": 160,
      "unit": "MATH38141",
      "summary": "Builds on material covered in Statistical Methods MATH20802."
    },
    {
      "id": 161,
      "unit": "MATH38181",
      "summary": "The same lecturer as for Statistical Methods MATH20802, so by this point you know if you are a fan or not."
    },
    {
      "id": 162,
      "unit": "MATH38181",
      "summary": "Requires a fair amount of work at home to get to grips with the material."
    },
    {
      "id": 163,
      "unit": "MATH38181",
      "summary": "The 10-credit version deals with the underlying theory and gives a few examples of the uses of it."
    },
    {
      "id": 164,
      "unit": "MATH38181",
      "summary": "Students interested more in the financial aspects are advised to take the 15-credit version of the course as this contains a lot more material on financial applications."
    },
    {
      "id": 165,
      "unit": "MATH38191",
      "summary": "No negative comments about the lecturer, though occasionally volume and clarity are issues."
    },
    {
      "id": 166,
      "unit": "MATH38191",
      "summary": "The course aim is to get students into a position where they can analyse financial data using statistical methods."
    },
    {
      "id": 167,
      "unit": "MATH38191",
      "summary": "Knowledge of some of the material from Random Models MATH20712 is useful, though it is covered thoroughly in lectures."
    },
    {
      "id": 168,
      "unit": "MATH38191",
      "summary": "A 15-credit version of the course is available, which extends the material from the 10-credit version into a more generalised setting."
    },
    {
      "id": 169,
      "unit": "MATH39001",
      "summary": "The lecturer for this course speaks quietly and does expect students to pick up ideas rather fast."
    },
    {
      "id": 170,
      "unit": "MATH39001",
      "summary": "The course is split into two sections with very little overlap between them. All problems are related to real life situations, for example electrical circuits."
    },
    {
      "id": 171,
      "unit": "MATH39001",
      "summary": "Despite using a lot of examples, every proof is examinable, and many require mathematical trickery to get the desired result."
    },
    {
      "id": 172,
      "unit": "MATH39001",
      "summary": "Example classes are just a case of going through the solution sheets"
    },
    {
      "id": 173,
      "unit": "MATH39001",
      "summary": "Some of the algorithms and other techniques in this course are also used in Discrete Mathematics MATH20902 so anyone going from that course to this should be in good stead."
    },
    {
      "id": 174,
      "unit": "MATH31022",
      "summary": "This course is touted as the most difficult (pure) offered by the school. There are some challenging new concepts to get your head around and a lot of material to learn"
    },
    {
      "id": 175,
      "unit": "MATH31022",
      "summary": "However the lecturer is arguably one of the best at the university, focusing on where he knows students struggle, and explains things in a clear and thorough way, and is very approachable during tutorials. Classic chalk and talk."
    },
    {
      "id": 176,
      "unit": "MATH31022",
      "summary": "Tough exam, every question taken straight from the lecture notes/example sheets, but the lecturer can tell who is replicating from memory and who actually understands the material."
    },
    {
      "id": 177,
      "unit": "MATH31022",
      "summary": "A pure course with some highlights to do with prime number theory, all fascinating and relevant material. Definitely manageable provided you keep on top of the work, and don’t let yourself get too far behind."
    },
    {
      "id": 178,
      "unit": "MATH31022",
      "summary": "Available as a 15-credit version, which makes the 10-credit version seem a bit easier. Extra lectures and problems classes specifically for these students, and as few people take this option almost all students who do the higher credit version do well."
    },
    {
      "id": 179,
      "unit": "MATH31072",
      "summary": "A different style of course to Introduction to Topology MATH31051, however still a lot of definitions. Enjoyable nonetheless."
    },
    {
      "id": 180,
      "unit": "MATH31072",
      "summary": "There are not as many proofs on this course as in other pure courses, in fact it is the applications that are most important."
    },
    {
      "id": 181,
      "unit": "MATH31072",
      "summary": "The course is built around proving that any surface can be identified with one of 3 constructions (based on sphere, projective plane, torus), and to this end examples are key."
    },
    {
      "id": 182,
      "unit": "MATH31072",
      "summary": "The material does get a bit heavy towards the end, although this just means it takes a bit more work to understand."
    },
    {
      "id": 183,
      "unit": "MATH31072",
      "summary": "A 15-credit version of the course is available, consists of three extra topics which are designed to interest students, for example a discussion of the Four Colour Theorem."
    },
    {
      "id": 184,
      "unit": "MATH31082",
      "summary": "The lecturer is the same as for Introduction to Geometry MATH20222, and so all the comments on the lecturer there hold. It is worth noting again that his enthusiasm for the course is somewhat infectious."
    },
    {
      "id": 185,
      "unit": "MATH31082",
      "summary": "Despite being a pure course, there are very few proofs, in fact most students consider it as an applied course in disguise."
    },
    {
      "id": 186,
      "unit": "MATH31082",
      "summary": "Some quite abstract content which the lecturer helps visualise by moving it to examples you can picture, for example the sphere. Working through the problem sheets is key."
    },
    {
      "id": 187,
      "unit": "MATH31082",
      "summary": "Content of the course is interesting, but will require extra work at home due to the lecturer occasionally leaving examples/definitions half finished."
    },
    {
      "id": 188,
      "unit": "MATH31082",
      "summary": "Lecturer hands out a programme of examination in the final week which outlines the material which students need to know for the exam."
    },
    {
      "id": 189,
      "unit": "MATH31082",
      "summary": "There is a 15-credit version of the course available, with a double lecture towards the end of the course to go through relevant examinable material."
    },
    {
      "id": 190,
      "unit": "MATH32012",
      "summary": "As mentioned earlier (see Coding Theory MATH32031) section, a very good lecturer who is clear and precise, using the traditional chalk and talk method."
    },
    {
      "id": 191,
      "unit": "MATH32012",
      "summary": "The problem sheets are really good, with optional questions that not even the lecturer knows the answer to, purely to challenge students."
    },
    {
      "id": 192,
      "unit": "MATH32012",
      "summary": "Follows directly on from Algebraic Structures 2, focusing on the polynomial ring results."
    },
    {
      "id": 193,
      "unit": "MATH32012",
      "summary": "Students doing this course alongside Introduction to Algebraic Geometry MATH32062 (see below) will find the final few weeks of the course easier as there is a fair amount of overlap."
    },
    {
      "id": 194,
      "unit": "MATH32012",
      "summary": "The take-home coursework usually contains one or two questions that are very difficult, sometimes even requiring knowledge of other courses. The exam is a mixture of computational questions and proofs, usually with one or two harder parts which will challenge all students."
    },
    {
      "id": 195,
      "unit": "MATH32062",
      "summary": "This course is taught better than Combinatorics and Graph Theory MATH39001 despite it being the same lecturer."
    },
    {
      "id": 196,
      "unit": "MATH32062",
      "summary": "The content itself combines geometry and algebra, and this course and Commutative Algebra MATH32012 (see above) go well together."
    },
    {
      "id": 197,
      "unit": "MATH32062",
      "summary": "Chalk and talk with some slides to demonstrate the geometrical ideas. A heart shaped graph is displayed on Valentines Day."
    },
    {
      "id": 198,
      "unit": "MATH32062",
      "summary": "A lot of proofs are required, however these follow in a similar pattern to proofs on previous algebra courses, and the lecturer tells you which are non-examinable."
    },
    {
      "id": 199,
      "unit": "MATH32112",
      "summary": "The lecturer is not the most approachable, however if asked a good question he will give a good answer!"
    },
    {
      "id": 200,
      "unit": "MATH32112",
      "summary": "A relatively dry course, very few examples and a lot of theory, requires work at home to understand what is actually going on."
    },
    {
      "id": 201,
      "unit": "MATH32112",
      "summary": "There is a lot of material and it is covered quickly, however this is to accommodate the 15-credit material and some extra notes at the end."
    },
    {
      "id": 202,
      "unit": "MATH32112",
      "summary": "Knowing the proofs and definitions is vital for the exam, which isn’t too bad if you’ve learned the material."
    },
    {
      "id": 203,
      "unit": "MATH32112",
      "summary": "There is a 15-credit version available, which consists of an extra section of the notes which is covered in lectures (though he doesn’t say until after completing the section that it is not for 10-credit students). As it is covered in lectures there is less work at home for this than many other 15-credit courses"
    },
    {
      "id": 204,
      "unit": "MATH34032",
      "summary": "A good, approachable and enthusiastic lecturer, despite going through the notes quickly due to a vast amount of material."
    },
    {
      "id": 205,
      "unit": "MATH34032",
      "summary": "Method based course, requirements include being able to solve differential equations easily, and good knowledge of integration."
    },
    {
      "id": 206,
      "unit": "MATH34032",
      "summary": "Most students say the example classes good, although the problem sheets themselves are very long."
    },
    {
      "id": 207,
      "unit": "MATH34032",
      "summary": "There is some overlap (though not much) with Wave Motion MATH35012."
    },
    {
      "id": 208,
      "unit": "MATH35012",
      "summary": "A course that is given in a similar style to Viscous Fluid Flow MATH35001. Lecturer is enthusiastic and interesting, which in turn makes you want to learn more about the course."
    },
    {
      "id": 209,
      "unit": "MATH35012",
      "summary": "Content includes ocean waves, elastic strings, and sound waves. To take this course you must be confident with solving differential equations, previous fluid courses useful not essential."
    },
    {
      "id": 210,
      "unit": "MATH35012",
      "summary": "Problem sheets and example classes are good, lecturer willing to keep explaining until it finally clicks."
    },
    {
      "id": 211,
      "unit": "MATH35012",
      "summary": "The coursework is challenging, designed to make you actually learn the material rather than just copy out results."
    },
    {
      "id": 212,
      "unit": "MATH35032",
      "summary": "The beginning of the course is very well thought out and structured, although the later sections don’t have typed notes and the handwritten ones available are a little difficult to follow initially."
    },
    {
      "id": 213,
      "unit": "MATH35032",
      "summary": "The lecturer is very enthusiastic and sometimes illustrates points with interesting examples."
    },
    {
      "id": 214,
      "unit": "MATH35032",
      "summary": "Differential equations and linear algebra (in particular matrix reduction and manipulation) are vital, so either look at this in advance or be willing to learn."
    },
    {
      "id": 215,
      "unit": "MATH35032",
      "summary": "There is a lot of content, sometimes a bit rushed at the end, although it is well delivered."
    },
    {
      "id": 216,
      "unit": "MATH35032",
      "summary": "Lecturer posts relevant problems to exam in final weeks, although all the problems are useful in their own way."
    },
    {
      "id": 217,
      "unit": "MATH37012",
      "summary": "The lecturer has received mixed reviews, however it has been commented that the lectures are boring, and as a result you sometimes miss something important."
    },
    {
      "id": 218,
      "unit": "MATH37012",
      "summary": "No online notes, and the problem sheets are quite complicated and time consuming."
    },
    {
      "id": 219,
      "unit": "MATH37012",
      "summary": "The course is recommended to anyone interested in probability theory."
    },
    {
      "id": 220,
      "unit": "MATH37012",
      "summary": "There is some overlap with Random Models MATH20712, however this is not a prerequisite."
    },
    {
      "id": 221,
      "unit": "MATH38032",
      "summary": "Lecture notes are brief slide notes, and it is difficult to follow the lectures so writing up your own notes is the most challenging part."
    },
    {
      "id": 222,
      "unit": "MATH38032",
      "summary": "All marks come from the examination, which is very tough, and during exam time lecturer will not help those who haven’t turned up to tutorials."
    },
    {
      "id": 223,
      "unit": "MATH38032",
      "summary": "Available as a 15-credit course unit, extra lectures and topics covered. There is also a coursework introduced worth 20% of the mark."
    },
    {
      "id": 224,
      "unit": "MATH38052",
      "summary": "An interesting course with not too much material compared to other courses."
    },
    {
      "id": 225,
      "unit": "MATH38052",
      "summary": "Introduces a new way of thinking about statistical analysis."
    },
    {
      "id": 226,
      "unit": "MATH38052",
      "summary": "The exams are very similar year after year, which makes revision a bit easier."
    },
    {
      "id": 227,
      "unit": "MATH38052",
      "summary": "Available as a 15-credit version, which adds an extra set of topics which aim to familiarise students with the methodology and applications of some standard techniques in modelling and analysing survival data."
    },
    {
      "id": 228,
      "unit": "MATH36022",
      "summary": "The lecturer explains the material very well, and is popular with the majority of students on the course."
    },
    {
      "id": 229,
      "unit": "MATH36022",
      "summary": "Builds upon Numerical Analysis 1, with an emphasis on methods and a few proofs."
    },
    {
      "id": 230,
      "unit": "MATH36022",
      "summary": "Not many problems on the example sheets, but what is on the sheets is difficult, both conceptually and computationally."
    },
    {
      "id": 231,
      "unit": "MATH36022",
      "summary": "Having said that the example classes are very useful."
    },
    {
      "id": 232,
      "unit": "MATH36032",
      "summary": "Three reports spread out over the semester, but these are difficult and time consuming, so do not take this course as an easy option."
    },
    {
      "id": 233,
      "unit": "MATH36032",
      "summary": "Very frustrating as it sometimes seems like a lot of the useful material hasn’t been given to you, but the majority of it will be covered in lectures."
    },
    {
      "id": 234,
      "unit": "MATH36032",
      "summary": "Most of the course time will be spent in the computer rooms where the lecturer and postgraduate students will help with problems about the coursework."
    },
    {
      "id": 235,
      "unit": "MATH36032",
      "summary": "The assignments themselves vary dramatically, requires time to think of the right approach, though the lecturer does cover all relevant material."
    },
    {
      "id": 236,
      "unit": "MATH36032",
      "summary": "Being able to use LaTeX (or similar) is beneficial, however by the end of the course you will have learned this, which is helpful for those going on to do a third/ fourth year project."
    },
    {
      "id": 237,
      "unit": "MATH39012",
      "summary": "Good lecturer, approachable and willing to answer questions."
    },
    {
      "id": 238,
      "unit": "MATH39012",
      "summary": "Lectures dull, dictation from slides or over head projector (depending on the room)."
    },
    {
      "id": 239,
      "unit": "MATH39012",
      "summary": "General consensus is that the online notes are great, however some students found the course difficult while others found it easy."
    },
    {
      "id": 240,
      "unit": "MATH39012",
      "summary": "Example sheets are useful but the solutions can be difficult to follow."
    },
    {
      "id": 241,
      "unit": "MATH39032",
      "summary": "This is a great follow on from Introduction to Financial Mathematics MATH20912, however this is not a prerequisite."
    },
    {
      "id": 242,
      "unit": "MATH39032",
      "summary": "Lecturer is a ‘master of his field’, willing to answer any questions and the lectures are detailed, even if the lecture notes are just the same as the online notes."
    },
    {
      "id": 243,
      "unit": "MATH39032",
      "summary": "As the lecturer is an applied mathematician, there are certain overlaps in methodology to the fluid mechanics courses, however this isn’t a hindrance to students who are unfamiliar with these."
    },
    {
      "id": 244,
      "unit": "MATH39032",
      "summary": "The examples classes begin with the lecturer going through a relevant past exam problem, the rest is just a case of asking if you want help, which is only useful if you’ve done the problems beforehand."
    },
    {
      "id": 245,
      "unit": "MATH39032",
      "summary": "A good course unit for those into financial maths or those wanting something different."
    },
    {
      "id": 246,
      "unit": "MATH42041",
      "summary": "Excellent online notes, very detailed and easy to understand."
    },
    {
      "id": 247,
      "unit": "MATH42041",
      "summary": "A lot of material however, so it’s best to stay on top of it."
    },
    {
      "id": 248,
      "unit": "MATH42041",
      "summary": "Lecturer is approachable, always available in his office to speak to students."
    },
    {
      "id": 249,
      "unit": "MATH42041",
      "summary": "Coursework consists of problems to take home throughout the semester."
    },
    {
      "id": 250,
      "unit": "MATH42061",
      "summary": "Coursework is two sets of problems throughout the semester to be done at home. Deadlines usually in October and December."
    },
    {
      "id": 251,
      "unit": "MATH42061",
      "summary": "Good knowledge of Group Theory is necessary is this is built upon in the first few weeks."
    },
    {
      "id": 252,
      "unit": "MATH43051",
      "summary": "Coursework is two take-home tests, worth 10% each."
    },
    {
      "id": 253,
      "unit": "MATH43051",
      "summary": "Lecturer is widely respected, very friendly and understanding of where students struggle."
    },
    {
      "id": 254,
      "unit": "MATH43051",
      "summary": "Knowledge of predicate logic is useful at the beginning, however the relevant material from this is covered in the lectures assuming no prior knowledge."
    },
    {
      "id": 255,
      "unit": "MATH44041",
      "summary": "Lecturer is nationally well renowned, and eager to help students with problems."
    },
    {
      "id": 256,
      "unit": "MATH44041",
      "summary": "The course assumes no prior knowledge, however students with the ability to picture physical scenarios will have an advantage."
    },
    {
      "id": 257,
      "unit": "MATH44041",
      "summary": "Dynamical systems theory is the mathematical theory of time-varying systems, used in the modelling of a wide range of physical, biological, engineering, economic and other phenomena."
    },
    {
      "id": 258,
      "unit": "MATH45061",
      "summary": "There is a lot of material to cover in the course, and so about half of the tutorial classes will instead be devoted to extra lecture time."
    },
    {
      "id": 259,
      "unit": "MATH45061",
      "summary": "No knowledge of previous fluid or solid mechanics courses is assumed, however the thought processes learned in these will be beneficial."
    },
    {
      "id": 260,
      "unit": "MATH45061",
      "summary": "The course starts from fundamental assumptions and builds upon these to derive all the theory that is assumed in other applied courses."
    },
    {
      "id": 261,
      "unit": "MATH45061",
      "summary": "Arguably the most difficult applied course, due to the amount of material and the fact that a lot of it is theoretic. However, the lecturer is more than willing to go over students problems until they get the idea. A thoroughly enjoyable course for those who it interests."
    },
    {
      "id": 262,
      "unit": "MATH45061",
      "summary": "While the exam and coursework are hard, they are marked fairly based on understanding of the methods as opposed to getting the numbers right. That is, a computational slip won’t cost you many (if any) marks."
    },
    {
      "id": 263,
      "unit": "MATH47101",
      "summary": "It is strongly advised that students who wish to take this course also have taken Foundations of Modern Probability MATH20722 at some point in their academic career."
    },
    {
      "id": 264,
      "unit": "MATH47101",
      "summary": "An interesting course, despite the fact there is a lot of content"
    },
    {
      "id": 265,
      "unit": "MATH47101",
      "summary": "The course is made more difficult by the fact that it is 100 % examination and so it is difficult (though not impossible) to score very high marks."
    },
    {
      "id": 266,
      "unit": "MATH48011",
      "summary": "Students tend to find the linear models section of the course easier, though this was a level three course in its own right a few years ago."
    },
    {
      "id": 267,
      "unit": "MATH48011",
      "summary": "Fair exams, though you need to be on top of a lot of methods to do well."
    },
    {
      "id": 268,
      "unit": "MATH46101",
      "summary": "Lecturers answer questions when asked, and help students work through problems."
    },
    {
      "id": 269,
      "unit": "MATH46101",
      "summary": "the course is based on developing techniques to solve linear systems, least squares problems and eigenvalue problems."
    },
    {
      "id": 270,
      "unit": "MATH46101",
      "summary": "The end of the course is said to be more interesting because you see some applications of the methods, for example in correcting blurred images for tomography etc."
    },
    {
      "id": 271,
      "unit": "MATH46101",
      "summary": "Students are shown how to use MATLAB to help solve these types of problems, and as such there is some overlap with Problem Solving by Computer MATH36032, although neither is required for the other."
    },
    {
      "id": 272,
      "unit": "MATH49111",
      "summary": "Two projects, one worth 40% and the other worth 50%, along with weekly courseworks for the remaining 10%"
    },
    {
      "id": 273,
      "unit": "MATH49111",
      "summary": "The course covers the techniques required to develop C++ programs that solve mathematical and scientific problems. C++ is a tool used in all areas of maths, though it is most commonly associated with applied maths when performing simulations."
    },
    {
      "id": 274,
      "unit": "MATH49111",
      "summary": "Any students looking to do research into applied maths and want a head start are advised to consider this course, as the ability to construct programs is vital in postgraduate studies in certain fields"
    },
    {
      "id": 275,
      "unit": "MATH41112",
      "summary": "Good lecturer, provides good notes/examples/solutions."
    },
    {
      "id": 276,
      "unit": "MATH41112",
      "summary": "However as this is a ‘reading course’, there is only one lecture a week, the rest of the material is left to student."
    },
    {
      "id": 277,
      "unit": "MATH41112",
      "summary": "The fact that the course is 100% examination is not helped by the fact that there are a lot of results to remember."
    },
    {
      "id": 278,
      "unit": "MATH42122",
      "summary": "The lecturer is very popular with his students, although does occasionally wander off onto irrelevant points."
    },
    {
      "id": 279,
      "unit": "MATH42122",
      "summary": "It has been commented that the coursework is good in hindsight, that is, helps you revise for the exam."
    },
    {
      "id": 280,
      "unit": "MATH42122",
      "summary": "The exams follow a similar structure to one another, although you are required to remember a large number of results."
    },
    {
      "id": 281,
      "unit": "MATH43042",
      "summary": "There are two take home tests (one in week 5 and one in week 10), each one worth 10%."
    },
    {
      "id": 282,
      "unit": "MATH43042",
      "summary": "Students are advised to have basic knowledge of predicate logic, however this can be learned as and when it’s necessary"
    },
    {
      "id": 283,
      "unit": "MATH43042",
      "summary": "Students who take this course tend to enjoy it, however be aware that is (as the name would suggest) very theorem-proof based."
    },
    {
      "id": 284,
      "unit": "MATH45132",
      "summary": "The course is largely self-contained, however students who have taken Viscous Fluid Flow MATH35001 may find themselves at an advantage for some of the course."
    },
    {
      "id": 286,
      "unit": "MATH45132",
      "summary": "The exam tends to be more based on applications of the results derived in lectures, however some of the smaller derivations can be asked."
    },
    {
      "id": 287,
      "unit": "MATH45132",
      "summary": "A useful course for students who want to go on to further study in fields such as reactiondiffusion systems."
    },
    {
      "id": 288,
      "unit": "MATH45122",
      "summary": "There are no prerequisites to this course however there is some overlap with Wave Motion MATH35012 and students who enjoyed this course are recommended to try this."
    },
    {
      "id": 289,
      "unit": "MATH45122",
      "summary": "Again the focus of this course is more on applying results and using physical intuition as opposed to deriving these results."
    },
    {
      "id": 290,
      "unit": "MATH47112",
      "summary": "The course starts from the basic ideas from Probability 2, and builds up to giving students the understanding of Brownian motion and diffusion processes."
    },
    {
      "id": 291,
      "unit": "MATH47112",
      "summary": "These perform a key role in financial mathematics, so students with an interest in following this route should consider taking this course."
    },
    {
      "id": 292,
      "unit": "MATH48082",
      "summary": "There is some overlap with Generalised Linear Models MATH38052."
    },
    {
      "id": 293,
      "unit": "MATH48082",
      "summary": "Again this is a course useful to students who have an interest in moving into some form of statistical analysis post degree, as it helps students understand the possible pitfalls of experimental data"
    },
    {
      "id": 294,
      "unit": "MATH48122",
      "summary": "The courseworks are every other week, and students are advised to use the tutorials to ask questions about these."
    },
    {
      "id": 295,
      "unit": "MATH48122",
      "summary": "By the end of the course you should have knowledge of how computers help statistical computations, and how you may use computers to apply algorithms to certain problems."
    },
    {
      "id": 296,
      "unit": "MATH48122",
      "summary": "A methods based course as opposed to proving the underlying theory."
    },
    {
      "id": 297,
      "unit": "MATH48132",
      "summary": "This course unit is naturally related to courses on statistical modelling, for example Generalized Linear Models MATH38052."
    },
    {
      "id": 298,
      "unit": "MATH48132",
      "summary": "Students should be familiar with R before the course begins, however this is not strictly necessary."
    },
    {
      "id": 299,
      "unit": "MATH49102",
      "summary": "The lecturer is well respected and very prompt at replying to emails."
    },
    {
      "id": 300,
      "unit": "MATH49102",
      "summary": "Students who have studied finance before, in particular Mathematical Modelling in Finance MATH39032 will find some of the material familiar, even if it is in a different light."
    },
    {
      "id": 301,
      "unit": "MATH40082",
      "summary": "Assessment from the course comes from a series of reports. The dates for submission, length and weighting of reports are given at the beginning of the semester"
    },
    {
      "id": 302,
      "unit": "MATH40082",
      "summary": "The material covers a range of topics, and requires students to write a series of computer programs to solve a specified problem."
    },
    {
      "id": 303,
      "unit": "MATH40082",
      "summary": "Despite the fact there is no exam the course is quite time consuming and so this shouldn’t be taken as an easy way out of exams."
    },
    {
      "id": 304,
      "unit": "MATH46052",
      "summary": "The lecturer is an expert in this field and very passionate about the course which makes you want to do well."
    },
    {
      "id": 305,
      "unit": "MATH46052",
      "summary": "Material in the course is hard and there is a lot of it, but as it is level four this is to be expected."
    },
    {
      "id": 306,
      "unit": "MATH46052",
      "summary": "Difficult to score high marks as the exam and coursework are marked to a high and precise standard."
    },
    {
      "id": 307,
      "unit": "MATH46132",
      "summary": "Builds upon the prerequisite course and so it is essential to revise this before taking the course."
    },
    {
      "id": 308,
      "unit": "MATH46132",
      "summary": "MATLAB is used to demonstrate problems and methods in the course, however it is not required to know about programming to take this course."
    },
    {
      "id": 309,
      "unit": "MATH46132",
      "summary": "Sometimes the course visits some of the experiments that take place throughout the university, which is unique among maths courses, and a nice opportunity to take."
    }
  ]
}
