{
  "units": [
    {
      "id": "MATH20122",
      "name": "Metric Spaces",
      "lecturer": "Prof. N. Ray",
      "summary": "A metric space is a set together with a good definition of the distance between each pair of points in the set. Metric spaces occur naturally in many parts of mathematics, including geometry, fractal geometry, topology, functional analysis and number theory. This lecture course will present the basic ideas of the theory, and illustrate them with a wealth of examples and applications.\nThis course unit is strongly recommended to all students who intend to study pure mathematics and is relevant to all course units involving advanced calculus or topology.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20132",
      "name": "Calculus of Several Variables",
      "lecturer": "Dr M. Coleman",
      "summary": "Functions of several variables were briefly considered in first year calculus courses when the notion of partial derivative was introduced. Although there are some similarities with the familiar theory of one real variable, the theory for functions of several variables is far richer. For example, for functions of several variables, the critical points might be maxima, minima or saddle points (which are minima in one direction and maxima in another direction). A key idea is to generalize the definition of the derivative at a point to the the derivative of a map f: Rn Rm at a point a of Rn. This is the Frchet derivative, which is a linear map df(a): Rn Rm (often represented by a matrix whose entries are partial derivatives) which gives the best approximation to the function at the point a. This derivative is used in a number of very elegant and useful results, in particular the Inverse Function Theorem and the Implicit Function Theorem, and is a key notion in the study of the critical points of functions of several variables.\nThe Frchet derivative is an example of a differential 1-form on Rn and so naturally leads on to an introduction to the basic ideas of differential k-forms. Differential k-forms are fundamental in the integral calculus of functions of several variables and this is briefly considered.",
      "coursework": 50,
      "exam": 50
    },
    {
      "id": "MATH20142",
      "name": "Complex Analysis",
      "lecturer": "Dr. N. Sidorov",
      "summary": "The first half of the course describes how the basic ideas of the calculus of real functions of a real variable (continuity, differentiation and integration) can be made precise and how the basic properties can be developed from the definitions. It builds on the treatment of sequences and series in MATH10242. Important results are the Mean Value Theorem, leading to the representation of some functions as power series (the Taylor series), and the Fundamental Theorem of Calculus which establishes the relationship between differentiation and integration. The second half of the course extends these ideas to complex functions of a complex variable. It turns out that complex differentiability is a very strong condition and differentiable functions behave very well. Integration is along paths in the complex plane. The central result of this spectacularly beautiful part of mathematics is Cauchy's Theorem guaranteeing that certain integrals along closed paths are zero. This striking result leads to useful techniques for evaluating real integrals based on the 'calculus of residues'.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20212",
      "name": "Algebraic Structures 2",
      "lecturer": "Dr. L. Walker",
      "summary": "This course builds on Algebraic Structures 1, which is a prerequisite, and continues the strong emphasis on examples.\nThe algebraic structures of rings and fields will be introduced. The construction of quotient rings and the relationship with homomorphisms is one of the main themes. These ideas will be used to construct roots of polynomials in extension fields. Factorisation in polynomial rings and rings of integers of number fields will also be studied.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20222",
      "name": "Introduction to Geometry",
      "lecturer": "Dr. H. Khudaverdian",
      "summary": "This course unit introduces the basic ideas of the geometry of curves and surfaces in Euclidean space, differential forms and elementary topological concepts such as the Euler characteristic. These ideas permeate all modern mathematics and its applications.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20502",
      "name": "Fluid Mechanics",
      "lecturer": "Dr. M. Simon",
      "summary": "The primary aim of this course unit is to provide students with a first introduction to continuum mechanics in general and theoretical fluid mechanics in particular. The material provides the student with an essential background to many third and fourth level courses on physical applied mathematics.\nFluid mechanics is concerned with understanding, and hence predicting, the properties (pressure, density, velocity etc.) of liquids and gases under external forces. This subject provides one of the major modern areas for the successful practical application of mathematics. Water, blood, air are all examples of fluids; of the many diverse fields where an understanding of the motion of fluids is important, one can mention oceanography and meteorology (in particular the dynamics of ocean circulation and weather forecasting), biological fluid dynamics (for example, blood flows through arteries), and aerodynamics.\nThe main physical focus is to calculate the lift forces on a body moving in a fluid, e.g. an aeroplane wing, and it is demonstrated briefly how such forces lead to the behaviour of footballs, cricket balls, golf balls, frisbees, aerobies, boomerangs, etc.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20512",
      "name": "Classical Mechanics",
      "lecturer": "Dr G. W. Jones",
      "summary": "This course concerns the general description and analysis of the motion of systems particles acted on by forces. Assuming a basic familiarity with Newton's laws of motion and their application in simple situations, we shall develop the advanced techniques necessary for the study of more complicated systems. We shall also consider the beautiful extensions of Newton's equations due to Lagrange and Hamilton, which allow for simplified treatments of many interesting problems and which provide the foundation for the modern understanding of dynamics. The course is a useful primer to third and fourth level course units in physical applied mathematics.",
      "coursework": 30,
      "exam": 70
    },
    {
      "id": "MATH20712",
      "name": "Random Models",
      "lecturer": "Dr. X. Jin",
      "summary": "The course introduces some simple stochastic processes, that is phenomena which evolve in time in a non-deterministic way. It applies the techniques developed in Probability and Statistics 1 and 2 together with the use of generating functions (or power series) to tackle problems such as the gambler's ruin problem, or calculating the probability of the extinction of certain populations.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20722",
      "name": "Foundations of Modern Probability",
      "lecturer": "Dr. J. Bagley",
      "summary": "The law of large numbers and the central limit theorem are formulated and proved. These two results embody the most important results of classical probability theory having an endless number of applications. A good understanding of MATH10101 or 10111, 20101 or 20111, and 20701 is required.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20802",
      "name": "Statistical Methods",
      "lecturer": "Dr. S. Nadarajah",
      "summary": "Statistical methodology is concerned with taking the numerical information contained in a sample (the data) and using it to make statements (or inferences) about the population from which the sample is drawn. In that the sample provides incomplete information about the entire population, there is inevitably some uncertainty relating to any inferences made. The methods developed in this course unit not only acknowledge this uncertainty but seek to model it in a meaningful way.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20812",
      "name": "Practical Statistics",
      "lecturer": "Dr. G. Boshnakov",
      "summary": "In this course statistical methods and concepts are put in the context of their practical application with emphasis on model selection and diagnostics. Students do a series of small projects in class and as homework. Some projects are complete data analysis exercises centred around some statistical topic",
      "coursework": 100,
      "exam": 0
    },
    {
      "id": "MATH20902",
      "name": "Discrete Mathematics",
      "lecturer": "Dr. M. Muldoon",
      "summary": "Modern Discrete Mathematics is a broad subject bearing on everything from logic to logistics. Roughly speaking, it is a part of mathematics that touches on those subjects that Calculus and Algebra can't: problems where there is no sensible notion continuity or smoothness and little algebraic structure. The subject, which is typically concerned with finiteor at the most countablesets of objects, abounds with interesting, concrete problems and entertaining examples.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20602",
      "name": "Numerical Analysis",
      "lecturer": "Dr. M. Lotz",
      "summary": "Numerical analysis is concerned with finding numerical solutions to problems for which analytical solutions either do not exist or are not readily or cheaply obtainable. This course provides an introduction to the subject, focusing on the three core topics of iteration, interpolation and quadrature.\nThe module starts with 'interpolation schemes', methods for approximating functions by polynomials, and 'quadrature schemes', numerical methods for approximating integrals, will then be explored in turn. The second half of the module looks at solving systems of linear and nonlinear equations via iterative techniques. In the case of linear systems, examples will be drawn from the numerical solution of differential equations.\nStudents will learn about practical and theoretical aspects of all the algorithms. Insight into the algorithms will be given through MATLAB illustrations, but the course does not require any programming.",
      "coursework": 70,
      "exam": 30
    },
    {
      "id": "MATH20302",
      "name": "Propositional Logic",
      "lecturer": "Dr G. Jones",
      "summary": "Logic is the study of arguments: what they are and what it means to say that they are sound. As such it is central to Mathematics, Philosophy and, to an increasing extent in recent years, Computer Science.\nMost of this course unit will deal with the most basic sort of logical argument (i.e., in everyday parlance, what we mean by 'A follows from B'), namely those which depend for their soundness simply on the commonly agreed interpretations of the logical connectives 'not', 'and', 'or' and 'implies'. That is referred to as propositional logic.\nWe shall characterise the above notion of 'follows' in two fundamentally different ways, firstly in terms of preservation of truth (semantically), and secondly in terms of the formal rules it obeys (proof theoretically, or syntactically). The highlight of the course unit will be the Completeness Theorem for Propositional Logic, which tells us that these two quite different characterisations are equivalent. This is the younger sibling of the Completeness Theorem for Predicate Logic (which is covered in the course, MATH33001, on Predicate Logic). That is a fundamental result for Mathematics which says that one can set up a notion of formal mathematical proof which is strong enough to capture mathematical truth: if something isn't formally provable then there must exist a counterexample. The propositional logic version of that theorem already allows us to introduce the key concepts and to see how a proof of such a general result can be achieved.\nIn the final few lectures the student is introduced to some basic ideas about predicate logic. This deals with languages which allow the use of variables together with the quantifiers for all... and there exists... as well as functions, relations and constants. Such languages are of far greater expressive power than those of propositional logic and using them one can, in principle, formalise any mathematical argument. This part of the course unit serves as a brief introduction to these logics with quantifiers and to concepts which will be used in some level 3/4 units in Logic.",
      "coursework": 50,
      "exam": 50
    },
    {
      "id": "MATH20912",
      "name": "Introduction to Financial Mathematics",
      "lecturer": "Dr. P. Johnson",
      "summary": "This course is intended to serve as a basic introduction to financial mathematics. It gives a mathematical perspective on the valuation of financial instruments (futures, options, etc.) and their risk-management. The purpose of the course is to introduce students to the stochastic techniques employed in derivative pricing.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH20622",
      "name": "Programming with Python",
      "lecturer": "Dr Stefan Guttel",
      "summary": "The course will focus on teaching basic programming mechanisms in Python and on writing programs based on basic mathematical algorithms, as well as creating algorithms from various problems' descriptions.\nMost of the Python-specifc constructs will be avoided, to make students familiar with the concepts that they can easily apply to other programming environments they may encounter.\nNo prior computer programming knowledge is assumed.",
      "coursework": 100,
      "exam": 0
    },
    {
      "id": "MATH20522",
      "name": "Principles of Mathematical Modelling",
      "lecturer": "Dr. G. Evatt",
      "summary": "The Principles of Mathematical Modelling course is designed to provide students with a core and implementable knowledge of how mathematics can be used at the interdisciplinary interface.\nThe course is split into two complementary halves: Part I: Quantifiable Understanding; Part II: Control.\nEvery two weeks, the students will have attended: three lectures that provide students with the formal background to mathematical modelling; one demonstration lecture where a modelling problem is dissected; and two problem classes, where group work shall sometimes be required.",
      "coursework": 40,
      "exam": 60
    },
    {
      "id": "MATH31011",
      "name": "Fourier Analysis and Lebesgue Integration",
      "lecturer": "Prof. P. Symonds",
      "summary": "It is often convenient to represent functions as Fourier series. However, the convergence of such series is a delicate issue closely related to the theory of integration. A standard approach to integration on the real line, formalised by Riemann, is based on partitioning the domain into smaller intervals. This approach works in many situations but there are simple examples for which it fails. In the early 1900s, H. Lebesgue produced a better theory in which the key idea is to extend the notion of length from intervals to more complicated subsets of R. This started an area of mathematics it its own right, called Measure Theory. Most generally, this is about how one may sensibly assign a size to members of a collection of sets. One application of Lebesgue's ideas is that one can introduce a vector space of functions in which Fourier series appear in a natural way.\nThis course will appeal to students who have enjoyed MATH20101 or MATH20111 and MATH20122. It will be useful to student taking probability courses in years three and four since the ideas of measure theory have a central role in probability theory.",
      "coursework": 15,
      "exam": 85
    },
    {
      "id": "MATH31051",
      "name": "Introduction to Topology",
      "lecturer": "Prof. P. Eccles",
      "summary": "This course unit is concerned with the study of topological spaces and their structure-preserving functions (continuous functions). Topological methods underpin a great deal of present day mathematics and theoretical physics. Topological spaces are sets which have sufficient structure so that the notion of continuity may be defined for functions between topological spaces. This structure is not defined in terms of a distance function but in terms of certain subsets known as open subsets which are required to satisfy certain basic properties. Continuous functions may stretch or bend a space and so two spaces are considered to be topologically equivalent if one can be obtained from the other by by stretching and bending: for this reason topology is sometimes called rubber sheet geometry.\nThe first half of the course unit introduces the basic definitions and standard examples of topological spaces as well as various types of topological spaces with good properties: pathconnected spaces, compact spaces and Hausdorff spaces . The second half introduces the fundamental group and gives some standard applications of the fundamental group of a circle.",
      "coursework": 15,
      "exam": 85
    },
    {
      "id": "MATH31061",
      "name": "Differentiable Manifolds",
      "lecturer": "Dr. T. Voronov",
      "summary": "Differentiable manifolds are among the most fundamental notions of modern mathematics. Roughly, they are geometrical objects that can be endowed with coordinates; using these coordinates one can apply differential and integral calculus, but the results are coordinate-independent.\nExamples of manifolds start with open domains in Euclidean space Rn , and include multidimensional surfaces such as the n-sphere Sn and n-torus Tn, the projective spaces RPn and CPn, and their generalizations, matrix groups such as the rotation group SO(n), etc. Differentiable manifolds naturally appear in various applications, e.g., as configuration spaces in mechanics. They are arguably the most general objects on which calculus can be developed. On the other hand, differentiable manifolds provide for calculus a powerful invariant geometric language, which is used in almost all areas of mathematics and its applications.\nIn this course we give an introduction to the theory of manifolds, including their definition and examples; vector fields and differential forms; integration on manifolds and de Rham cohomology.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH32001",
      "name": "Group Theory",
      "lecturer": "Prof. P. Rowley",
      "summary": "The ideal aim of Group Theory is the classification of all groups (up to isomorphism). It will be shown that this goal can be achieved for finitely generated abelian groups. In general, however, there is no hope of a similar result as the situation is far too complex, even for finite groups. Still, since groups are of great importance for the whole of mathematics, there is a highly developed theory of outstanding beauty. It takes just three simple axioms to define a group, and it is fascinating how much can be deduced from so little. The course is devoted to some of the basic concepts and results of Group Theory.",
      "coursework": 10,
      "exam": 90
    },
    {
      "id": "MATH32031",
      "name": "Coding Theory",
      "lecturer": "Dr. Y. Bazlov",
      "summary": "Coding theory plays a crucial role in the transmission of information. Due to the effect of noise and interference, the received message may differ somewhat from the original message which is transmitted. The main goal of Coding Theory is the study of techniques which permit the detection of errors and which, if necessary, provide methods to reconstruct the original message. The subject involves some elegant algebra and has become an important tool in banking and commerce.",
      "coursework": 10,
      "exam": 90
    },
    {
      "id": "MATH32051",
      "name": "Hyperbolic Geometry",
      "lecturer": "Dr. C. Walkden",
      "summary": "Consider the Euclidean plane R2. If we take a straight line L and a point p not on that line, then there is a unique straight line through p that never intersects L (draw a picture!). This is Euclid's parallel postulate.\nEuclid introduced several axioms for what is now called Euclidean geometry (that is, geometry in R2 or more generally inRn and a great deal of effort was employed in attempting to prove that these axioms implied the parallel postulate. However, in early 19th century, the hyperbolic plane was introduced as a setting in which Euclid's axioms hold but the parallel postulate fails: there may be infinitely many 'straight' lines through a point that do not intersect a given 'straight' line.\nToday, hyperbolic geometry is a rich and active area of mathematics with many beautiful theorems (and can be used to generate very attractive pictures)",
      "coursework": 0,
      "exam": 100
    },
    {
      "id": "MATH32071",
      "name": "Introduction to Number Theory",
      "lecturer": "Dr. M. Johnson",
      "summary": "Number theory is arguably one of the oldest and most fascinating branches of mathematics. This fascination stems from the fact that there are a great many theorems concerning the integers, which are extremely simple to state, but turn out to be rather hard to prove. Even more tantalisingly, there are many simple questions that one can ask about the integers, to which no answer is yet known. It may come as no surprise to you that many of these theorems and open problems relate to the mysterious nature of prime numbers.\nIn this course we will use a few elementary ideas along with one or two algebraic concepts to prove some appealing statements such as every positive integer is the sum of four squares and there are infinitely many primes of the form 4n+1. We will conclude the course by mentioning a few interesting open problems.",
      "coursework": 10,
      "exam": 90
    },
    {
      "id": "MATH34001",
      "name": "Applied Complex Analysis",
      "lecturer": "Dr. M. Simon",
      "summary": "This course unit is a natural successor to the second year course units on Complex Analysis. It introduces multivalued functions, analytic continuation and integral transforms, especially Fourier and Laplace transforms. These powerful and effective tools are used to solve many problems involving differential equations. The course is oriented towards applications rather than the theorem/proof style of development.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH36001",
      "name": "Matrix Analysis",
      "lecturer": "Dr. S. Guttel",
      "summary": "This course unit is an introduction to matrix analysis, covering both classical and more recent results that are useful in applying matrix algebra to practical problems. In particular it treats eigenvalues and singular values, matrix factorizations, function of matrices, and structured matrices. It builds on the first year linear algebra course. Apart from being used in many areas of mathematics, Matrix Analysis has broad applications in fields such as engineering, physics, statistics, econometrics and in modern application areas such as data mining and pattern recognition. Examples from some of these areas will be used to illustrate and motivate some of the theorems developed in the course.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH34011",
      "name": "Asymptotic Expansions and Perturbation Methods",
      "lecturer": "Prof. J. Gajjar",
      "summary": "The development of the theory of asymptotic expansions, which serves as a foundation for perturbation methods, is one of the most important achievements in applied mathematics in the twentieth century. Perturbation methods represent a very powerful tool in modern mathematical physics and in particular, in fluid dynamics. This course unit will introduce students to a range of modern asymptotic techniques and illustrate their use in model problems involving ordinary and partial differential equations.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH35001",
      "name": "Viscous Fluid Flow",
      "lecturer": "Prof. M. Heil",
      "summary": "This course is concerned with the mathematical theory of viscous fluid flows. Fluid mechanics is one of the major areas for the application of mathematics and has obvious practical applications in many important disciplines (aeronautics, meteorology, geophysical fluid mechanics, biofluid mechanics, and many others). Using a general continuum mechanical approach, we will first derive the governing equations (the famous Navier-Stokes equations) from first principles. We will then apply these equations to a variety of practical problems and examine appropriate simplifications and solution strategies.\nMany members of staff in the School have research interests in fluid mechanics and this course will lay the foundations for possible future postgraduate work in this discipline.",
      "coursework": 0,
      "exam": 100
    },
    {
      "id": "MATH35021",
      "name": "Elasticity",
      "lecturer": "Dr. A. Hazel",
      "summary": "This course unit gives an introduction to the linearised theory of elasticity. A typical problem of the subject is as follows: Suppose an elastic body (e.g. an underground oil pipe) is subjected to some loading on its outer surface. What is the stress distribution which is generated throughout the body? Does this stress distribution have unexpectedly large values which might lead to failure? The subject is developed, and particular problems solved, from a mathematical standpoint.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH36041",
      "name": "Essential Partial Differential Equations",
      "lecturer": "Dr S. Holman",
      "summary": "We study the well posedness of the classical PDEs by semigroup and weak approximation and rigorously develop numerical approximation by the Galerkin and finite difference method. The module is theoretical and has the flavour of a pure module; proofs are given.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH37001",
      "name": "Martingales with Applications to Finance",
      "lecturer": "Prof T. Zhang",
      "summary": "An introduction to a circle of ideas and fundamental results of the theory of martingales, which play a vital role in stochastic calculus and in the modern theory of finance.",
      "coursework": 0,
      "exam": 100
    },
    {
      "id": "MATH38001",
      "name": "Statistical Inference",
      "lecturer": "Dr. E. Kyprianou",
      "summary": "",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH38061",
      "name": "Multivariate Statistics",
      "lecturer": "Mr. M. Tso",
      "summary": "Statistical Inference is the body of principles and methods underlying the statistical analysis of data. In this course we introduce desirable properties that good estimators and hypothesis tests should enjoy and use them as criteria in the development of optimal estimators and test procedures.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH38071",
      "name": "Medical Statistics",
      "lecturer": "Prof. C. Roberts",
      "summary": "Randomised controlled trials are planned experimental studies on human subjects designed to assess the benefit of medical treatments. Other important areas of application of statistical methods in medical research are epidemiological studies, which investigate the possible causes of disease from observational data, diagnostic studies, which methods of disease diagnosis and meta-analysis, which considers combining information from multiple studies. Many of the major developments in modern statistics have been motivated by problems in medical research. Whilst briefly outlining other areas of application in medical research, the lecture course will introduce the statistical issue associated design and analysis of randomised controlled trials and in meta-analyses.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH38141",
      "name": "Regression Analysis",
      "lecturer": "Dr. A. Donev",
      "summary": "In many areas of science, technology and medicine one often wishes to explore the relationship between one observable random response and a number of explanatory variables, which may influence simultaneously the response. The required statistical principles and techniques are established and used to select a suitable model for a given dataset.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH38181",
      "name": "Extreme Values and Financial Risk",
      "lecturer": "Dr. S. Nadarajah",
      "summary": "The course will give some probabilistic and statistical details of univariate and bivariate extreme value theory. The topics covered will include: fundamental of univariate extreme value theory, the three extreme value distributions, various models for univariate extremes, fundamentals of bivariate extreme value theory, and various models for bivariate extremes. The course will contain a great deal material on applications of the models to finance. Software in R will be used.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH38191",
      "name": "Statistical Modelling in Finance",
      "lecturer": "Dr. J. Yuan",
      "summary": "This course unit is set up to support the finance pathway of the BSc in Mathematics and Statistics. No previous knowledge of finance is required.",
      "coursework": 20,
      "exam": 80
    },
    {
      "id": "MATH39001",
      "name": "Combinatorics and Graph Theory",
      "lecturer": "Dr. G. Megyesi",
      "summary": "A graph consists of a set of vertices with a set of edges connecting some pairs vertices. Depending on the context, the edges may represent a mathematical relation, two people knowing each other or roads connecting towns, etc. The graph theory part of the course deals with networks, structure of graphs, and extremal problems involving graphs.\nThe combinatorial half of this course is concerned with enumeration, that is, given a family of problems P(n), n a natural number, find a(n), the number of solutions of P(n) for each such n. The basic device is the generating function, a function F(t) that can be found directly from a description of the problem and for which there exists an expansion in the form F(t) = sum {a(n)gn(t); n a natural number}. Generating functions are also used to prove a family of counting formulae to prove combinatorial identities and obtain asymptotic formulae for a(n).",
      "coursework": 20,
      "exam": 80
    }
  ]
}
