{
  "units": [
    {"id": "MATH20122", "name": "Metric Spaces", "summary": "A metric space is a set together with a good definition of the distance between each pair of points in the set. Metric spaces occur naturally in many parts of mathematics, including geometry, fractal geometry, topology, functional analysis and number theory. This lecture course will present the basic ideas of the theory, and illustrate them with a wealth of examples and applications. This course unit is strongly recommended to all students who intend to study pure mathematics and is relevant to all course units involving advanced calculus or topology.", "coursework": 20, "exam": 80},
    {"id": "MATH20132", "name": "Calculus of Several Variables", "summary": "Functions of several variables were briefly considered in first year calculus courses when the notion of partial derivative was introduced. Although there are some similarities with the familiar theory of one real variable, the theory for functions of several variables is far richer. For example, for functions of several variables, the critical points might be maxima, minima or saddle points (which are minima in one direction and maxima in another direction). A key idea is to generalize the definition of the derivative at a point to the the derivative of a map f: Rn Rm at a point a of Rn. This is the Frchet derivative, which is a linear map df(a): Rn Rm (often represented by a matrix whose entries are partial derivatives) which gives the best approximation to the function at the point a. This derivative is used in a number of very elegant and useful results, in particular the Inverse Function Theorem and the Implicit Function Theorem, and is a key notion in the study of the critical points of functions of several variables. The Frchet derivative is an example of a differential 1-form on Rn and so naturally leads on to an introduction to the basic ideas of differential k-forms. Differential k-forms are fundamental in the integral calculus of functions of several variables and this is briefly considered.", "coursework": 50, "exam": 50},
    {"id": "MATH20142", "name": "Complex Analysis", "summary": "The first half of the course describes how the basic ideas of the calculus of real functions of a real variable (continuity, differentiation and integration) can be made precise and how the basic properties can be developed from the definitions. It builds on the treatment of sequences and series in MATH10242. Important results are the Mean Value Theorem, leading to the representation of some functions as power series (the Taylor series), and the Fundamental Theorem of Calculus which establishes the relationship between differentiation and integration. The second half of the course extends these ideas to complex functions of a complex variable. It turns out that complex differentiability is a very strong condition and differentiable functions behave very well. Integration is along paths in the complex plane. The central result of this spectacularly beautiful part of mathematics is Cauchy's Theorem guaranteeing that certain integrals along closed paths are zero. This striking result leads to useful techniques for evaluating real integrals based on the 'calculus of residues'.", "coursework": 20, "exam": 80},
    {"id": "MATH20212", "name": "Algebraic Structures 2", "summary": "This course builds on Algebraic Structures 1, which is a prerequisite, and continues the strong emphasis on examples. The algebraic structures of rings and fields will be introduced. The construction of quotient rings and the relationship with homomorphisms is one of the main themes. These ideas will be used to construct roots of polynomials in extension fields. Factorisation in polynomial rings and rings of integers of number fields will also be studied.", "coursework": 20, "exam": 80},
    {"id": "MATH20222", "name": "Introduction to Geometry", "summary": "This course unit introduces the basic ideas of the geometry of curves and surfaces in Euclidean space, differential forms and elementary topological concepts such as the Euler characteristic. These ideas permeate all modern mathematics and its applications.", "coursework": 20, "exam": 80},
    {"id": "MATH20502", "name": "Fluid Mechanics", "summary": "The primary aim of this course unit is to provide students with a first introduction to continuum mechanics in general and theoretical fluid mechanics in particular. The material provides the student with an essential background to many third and fourth level courses on physical applied mathematics. Fluid mechanics is concerned with understanding, and hence predicting, the properties (pressure, density, velocity etc.) of liquids and gases under external forces. This subject provides one of the major modern areas for the successful practical application of mathematics. Water, blood, air are all examples of fluids; of the many diverse fields where an understanding of the motion of fluids is important, one can mention oceanography and meteorology (in particular the dynamics of ocean circulation and weather forecasting), biological fluid dynamics (for example, blood flows through arteries), and aerodynamics. The main physical focus is to calculate the lift forces on a body moving in a fluid, e.g. an aeroplane wing, and it is demonstrated briefly how such forces lead to the behaviour of footballs, cricket balls, golf balls, frisbees, aerobies, boomerangs, etc.", "coursework": 20, "exam": 80},
    {"id": "MATH20512", "name": "Classical Mechanics", "summary": "This course concerns the general description and analysis of the motion of systems particles acted on by forces. Assuming a basic familiarity with Newton's laws of motion and their application in simple situations, we shall develop the advanced techniques necessary for the study of more complicated systems. We shall also consider the beautiful extensions of Newton's equations due to Lagrange and Hamilton, which allow for simplified treatments of many interesting problems and which provide the foundation for the modern understanding of dynamics. The course is a useful primer to third and fourth level course units in physical applied mathematics.", "coursework": 30, "exam": 70},
    {"id": "MATH20712", "name": "Random Models", "summary": "The course introduces some simple stochastic processes, that is phenomena which evolve in time in a non-deterministic way. It applies the techniques developed in Probability and Statistics 1 and 2 together with the use of generating functions (or power series) to tackle problems such as the gambler's ruin problem, or calculating the probability of the extinction of certain populations.", "coursework": 20, "exam": 80},
    {"id": "MATH20722", "name": "Foundations of Modern Probability", "summary": "The law of large numbers and the central limit theorem are formulated and proved. These two results embody the most important results of classical probability theory having an endless number of applications. A good understanding of MATH10101 or 10111, 20101 or 20111, and 20701 is required.", "coursework": 20, "exam": 80},
    {"id": "MATH20802", "name": "Statistical Methods", "summary": "Statistical methodology is concerned with taking the numerical information contained in a sample (the data) and using it to make statements (or inferences) about the population from which the sample is drawn. In that the sample provides incomplete information about the entire population, there is inevitably some uncertainty relating to any inferences made. The methods developed in this course unit not only acknowledge this uncertainty but seek to model it in a meaningful way.", "coursework": 20, "exam": 80},
    {"id": "MATH20812", "name": "Practical Statistics", "summary": "In this course statistical methods and concepts are put in the context of their practical application with emphasis on model selection and diagnostics. Students do a series of small projects in class and as homework. Some projects are complete data analysis exercises centred around some statistical topic", "coursework": 100, "exam": 0},
    {"id": "MATH20902", "name": "Discrete Mathematics", "summary": "Modern Discrete Mathematics is a broad subject bearing on everything from logic to logistics. Roughly speaking, it is a part of mathematics that touches on those subjects that Calculus and Algebra can't: problems where there is no sensible notion continuity or smoothness and little algebraic structure. The subject, which is typically concerned with finiteor at the most countablesets of objects, abounds with interesting, concrete problems and entertaining examples.", "coursework": 20, "exam": 80},
    {"id": "MATH20602", "name": "Numerical Analysis", "summary": "Numerical analysis is concerned with finding numerical solutions to problems for which analytical solutions either do not exist or are not readily or cheaply obtainable. This course provides an introduction to the subject, focusing on the three core topics of iteration, interpolation and quadrature. The module starts with 'interpolation schemes', methods for approximating functions by polynomials, and 'quadrature schemes', numerical methods for approximating integrals, will then be explored in turn. The second half of the module looks at solving systems of linear and nonlinear equations via iterative techniques. In the case of linear systems, examples will be drawn from the numerical solution of differential equations. Students will learn about practical and theoretical aspects of all the algorithms. Insight into the algorithms will be given through MATLAB illustrations, but the course does not require any programming.", "coursework": 70, "exam": 30}
  ]
}
